jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
/* MIT License

Copyright (c) 2024 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#pragma once

#include <sstream>
#include <memory>
#include <WiFi.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <vector>
#include <map>
#include <Wire.h>
// // #include "LogHandler.h"
#include "utils.h"
#include "logging/TagHandler.h"
#include "struct/voice.h"
#include "struct/motionProfile.h"
#include "struct/channel.h"
#include "struct/motionChannel.h"
#include "struct/buttonSet.h"
#include "enum.h"
#include "constants.h"
#include "channelMap.hpp"
#include "settingConstants.h"
#include "settingsFactory.h"
#include "TCode/PwmManager.h"

#define DESERIALIZE_SIZE 32768
#define SERIALIZE_SIZE 24576

#define LOG_BUILD_FEATURE(feature) LogHandler::debug(Tags::Settings, "Build feature: %s", #feature);

// using SETTING_STATE_FUNCTION_PTR_T = void (*)(const char *group, const char *settingNameThatChanged);

class SettingsHandler
{
public:
    static bool initialized;
    static int restartRequired;
    static bool saving;
    static bool motionPaused;
    static bool fullBuild;
    static inline bool channelRangesEnabled = true;
    static LogLevel logLevel;
    static std::vector<int> systemI2CAddresses;

    static ChannelMap channelMap;
    static BuildFeature buildFeatures[(int)BuildFeature::MAX_FEATURES];

    static inline MotionProfile *motionProfiles;
    static inline ButtonSet *buttonSets;

    // static bool staticIP;
    static char currentIP[IP_ADDRESS_LEN];
    static char currentGateway[IP_ADDRESS_LEN];
    static char currentSubnet[IP_ADDRESS_LEN];
    static char currentDns1[IP_ADDRESS_LEN];
    static char currentDns2[IP_ADDRESS_LEN];

    static bool apMode;

    // template<typename T,
    //          typename = std::enable_if<!std::is_const<T>::value || std::is_integral<T>::value || std::is_enum<T>::value || std::is_floating_point<T>::value || std::is_same<T, bool>::value>>
    // static void getValue(const char* name, T &value)
    // {
    //     m_settingsFactory->getValue(name, value);
    // }

    // static void getValue(const char* name, char* value, size_t len)
    // {
    //     m_settingsFactory->getValue(name, value, len);
    // }

    // static void defaultValue(const char* name)
    // {
    //     m_settingsFactory->defaultValue(name);
    // }

    static void init()
    {
        m_settingsFactory = SettingsFactory::getInstance();
        // Initialize SettingsFactory to load pin map and other cached settings
        if (!m_settingsFactory->init())
        {
            LogHandler::error(Tags::Settings, "SettingsFactory initialization failed");
            return;
        }

        motionProfiles = m_settingsFactory->getMotionProfiles();
        buttonSets = m_settingsFactory->getButtonSets();
        setBuildFeatures();
        setMotorType();

        // loadWifiInfo(false);
        // loadSettings(false);
        loadChannels(false);
        loadMotionProfiles(false);
        loadButtons(false);

        LogHandler::debug(Tags::Settings, "Last reset reason: %s", machine_reset_cause());
        initialized = true;
    }

    static void setMessageCallback(SETTING_STATE_FUNCTION_PTR_T f)
    {
        LogHandler::debug(Tags::Settings, "setMessageCallback");
        if (f == nullptr)
        {
            message_callback = 0;
        }
        else
        {
            message_callback = f;
        }
    }

    // static bool isBoardType(BoardType value) {
    //     return m_settingsFactory->getBoardType() == value;
    // }

    static void printFree(bool forcePrint = false)
    {
        if (forcePrint || LogHandler::getLogLevel() == LogLevel::DEBUG)
        {
            uint32_t freeHEap = ESP.getFreeHeap();
            uint32_t heapSize = ESP.getHeapSize();
            // https://esp32.com/viewtopic.php?t=27780
            // https://github.com/espressif/esp-idf/blob/master/components/heap/include/esp_heap_caps.h#L20-L37
            // esp_get_free_internal_heap_size
            Serial.printf("Used heap INTERNAL: %u/%u Free: %u\n", heapSize - freeHEap, heapSize, freeHEap);
            Serial.printf("Free psram: %u\n", ESP.getFreePsram());
            Serial.printf("Total Psram: %u\n", ESP.getPsramSize());
            Serial.printf("LittleFS used: %i\n", LittleFS.usedBytes());
            Serial.printf("LittleFS total: %i\n", LittleFS.totalBytes());
            // LogHandler::debug(Tags::Settings, "Used Psram: %u/%u", ESP.getPsramSize() - ESP.getFreePsram(), ESP.getPsramSize());
            Serial.printf("Sketch size: %u\n", ESP.getSketchSize());
            Serial.printf("Sketch free space: %u\n", ESP.getFreeSketchSpace());
            Serial.printf("DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
            Serial.printf("IRAM %u\n", heap_caps_get_free_size(MALLOC_CAP_32BIT));
            Serial.printf("FREE_HEAP Default %u\n", esp_get_free_heap_size());
            Serial.printf("MIN_FREE_HEAP %u\n", esp_get_minimum_free_heap_size());
            // uxTaskGetStackHighWaterMark
        }
    }

    static void restart(const int delayInSec = 0)
    {
        LogHandler::info(Tags::Settings, "Schedule device restart in %ld seconds", delayInSec);
        // Restart in main task loop
        restartRequired = delayInSec;
    }

    static void printWebAddress(const char *hostAddress)
    {
        char webServerportString[6];
        int webServerPort = 0;
        m_settingsFactory->getValue(WEBSERVER_PORT, webServerPort);
        sprintf(webServerportString, ":%d", webServerPort);
        LogHandler::info(Tags::Settings, "Web address: http://%s%s", hostAddress, webServerPort == 80 ? "" : webServerportString);
    }

    static bool saveAll(JsonObject obj = JsonObject())
    {
        if (!m_settingsFactory->saveAllToDisk(obj) || !saveMotionProfiles(obj) || !saveButtons(obj))
            return false;
        return true;
    }

