jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
    static bool saveAll(const String &data)
    {
        LogHandler::debug(Tags::Settings, "Save frome string");
        printFree();
        JsonDocument doc;

        DeserializationError error = deserializeJson(doc, data);
        if (error)
        {
            LogHandler::error(Tags::Settings, "Settings save: Deserialize error: %s", error.c_str());
            return false;
        }
        printFree();
        JsonObject obj = doc.as<JsonObject>();
        if (!saveAll(obj))
        {
            LogHandler::error(Tags::Settings, "Settings save: save error");
            return false;
        }
        return true;
    }

    static void getWifiInfo(char* buf, size_t bufLen)
    {
        const JsonDocument& srcDoc = m_settingsFactory->getNetworkSettings();

        // We must copy because we need to mask passwords before serializing
        JsonDocument doc;
        doc.set(srcDoc);

        const char *wifiPass = doc[WIFI_PASS_SETTING];
        if (wifiPass && strcmp(wifiPass, WIFI_PASS_DONOTCHANGE_DEFAULT))
        {
            doc[WIFI_PASS_SETTING] = DECOY_PASS; // Never set to actual password
        }
        else
        {
            doc[WIFI_PASS_SETTING] = WIFI_PASS_DONOTCHANGE_DEFAULT;
        }
        const char *apPass = doc[AP_MODE_PASS];
        if (apPass && strcmp(apPass, AP_MODE_PASS_DEFAULT))
        {
            doc[AP_MODE_PASS] = DECOY_PASS; // Never set to actual password
        }
        else
        {
            doc[AP_MODE_PASS] = AP_MODE_PASS_DEFAULT;
        }

        size_t written = serializeJson(doc, buf, bufLen);
        doc.clear();
        if (written == 0)
            buf[0] = '\0';
        if (LogHandler::getLogLevel() == LogLevel::VERBOSE)
            Serial.printf("Network Info: %s\n", buf);
    }

    static void getSystemInfo(String &buf)
    {
        JsonDocument doc; // 3500

        doc["esp32Version"] = FIRMWARE_VERSION_NAME;
        doc["esp32VersionNum"] = FIRMWARE_VERSION;
        doc["TCodeVersion"] = m_settingsFactory->getTcodeVersion();
        doc["lastRebootReason"] = machine_reset_cause();
        doc["channelRangesEnabled"] = getChannelRangesEnabled();

        JsonArray logLevels = doc["logLevels"].to<JsonArray>();
        JsonObject logLevelNone = logLevels.add<JsonObject>();
        logLevelNone["name"] = "None";
        logLevelNone["value"] = LogLevel::NONE;
        JsonObject logLevelError = logLevels.add<JsonObject>();
        logLevelError["name"] = "Error";
        logLevelError["value"] = LogLevel::ERROR;
        JsonObject logLevelWarning = logLevels.add<JsonObject>();
        logLevelWarning["name"] = "Warning";
        logLevelWarning["value"] = LogLevel::WARNING;
        JsonObject logLevelInfo = logLevels.add<JsonObject>();
        logLevelInfo["name"] = "info";
        logLevelInfo["value"] = LogLevel::INFO;
        JsonObject logLevelDebug = logLevels.add<JsonObject>();
        logLevelDebug["name"] = "Debug";
        logLevelDebug["value"] = LogLevel::DEBUG;
        JsonObject logLevelVerbose = logLevels.add<JsonObject>();
        logLevelVerbose["name"] = "Verbose";
        logLevelVerbose["value"] = LogLevel::VERBOSE;

        JsonArray tcodeVersions = doc["tcodeVersions"].to<JsonArray>();
        JsonObject v03 = tcodeVersions.add<JsonObject>();
        v03["name"] = "v0.3";
        v03["value"] = TCodeVersion::v0_3;
        JsonObject v04 = tcodeVersions.add<JsonObject>();
        v04["name"] = "v0.4 (Experimental)";
        v04["value"] = TCodeVersion::v0_4;
        JsonArray boardTypes = doc["boardTypes"].to<JsonArray>();
#if CONFIG_IDF_TARGET_ESP32
        JsonObject devkit = boardTypes.add<JsonObject>();
        devkit["name"] = "Devkit";
        devkit["value"] = (uint8_t)BoardType::DEVKIT;
#if MOTOR_TYPE == 0
        JsonObject SR6MB = boardTypes.add<JsonObject>();
        SR6MB["name"] = "SR6MB";
        SR6MB["value"] = (uint8_t)BoardType::CRIMZZON;
        JsonObject INControl = boardTypes.add<JsonObject>();
        INControl["name"] = "IN-Control";
        INControl["value"] = (uint8_t)BoardType::ISAAC;
#elif MOTOR_TYPE == 1
        JsonObject SSR1PCB = boardTypes.add<JsonObject>();
        SSR1PCB["name"] = "SSR1PCB";
        SSR1PCB["value"] = (uint8_t)BoardType::SSR1PCB;
#endif
#elif CONFIG_IDF_TARGET_ESP32S3
#ifdef S3_ZERO
        JsonObject S3_Zero = boardTypes.add<JsonObject>();
        S3_Zero["name"] = "S3 Zero";
        S3_Zero["value"] = (uint8_t)BoardType::ZERO;
#else
        JsonObject N8R8 = boardTypes.add<JsonObject>();
        N8R8["name"] = "S3 N8R8";
        N8R8["value"] = (uint8_t)BoardType::N8R8;
#endif
#if MOTOR_TYPE == 0
        JsonObject SR6PCB = boardTypes.add<JsonObject>();
        SR6PCB["name"] = "SR6PCB";
        SR6PCB["value"] = (uint8_t)BoardType::SR6PCB;
#endif
#endif
        int motorType = MOTOR_TYPE_DEFAULT;
        m_settingsFactory->getValue(MOTOR_TYPE_SETTING, motorType);
        doc["motorType"] = motorType;
        JsonArray buildFeaturesJsonArray = doc["buildFeatures"].to<JsonArray>();
        for (BuildFeature value : buildFeatures)
        {
            buildFeaturesJsonArray.add((int)value);
        }
        doc["moduleType"] = (int)MODULE_CURRENT;

        JsonArray availableTagsJsonArray = doc["availableTags"].to<JsonArray>();
        for (const char *tag : Tags::AvailableTags)
        {
            availableTagsJsonArray.add(tag);
        }
        JsonArray systemI2CAddressesJsonArray = doc["systemI2CAddresses"].to<JsonArray>();
        systemI2CAddressesJsonArray.add("0x0");
        for (int value : systemI2CAddresses)
        {
            char buf[10];
            hexToString(value, buf);
            systemI2CAddressesJsonArray.add(buf);
        }

        JsonArray deviceTypes = doc["deviceTypes"].to<JsonArray>();
        JsonObject defaultDevice = deviceTypes.add<JsonObject>();
#if MOTOR_TYPE == 0
        defaultDevice["name"] = "OSR";
        defaultDevice["value"] = DeviceType::OSR;
        JsonObject SR6 = deviceTypes.add<JsonObject>();
        SR6["name"] = "SR6";
        SR6["value"] = DeviceType::SR6;
        JsonObject TVIBE = deviceTypes.add<JsonObject>();
        TVIBE["name"] = "TVIBE";
        TVIBE["value"] = DeviceType::TVIBE;
#elif MOTOR_TYPE == 1
        defaultDevice["name"] = "SSR1";
        defaultDevice["value"] = DeviceType::SSR1;
        JsonArray encoderTypes = doc["encoderTypes"].to<JsonArray>();
        JsonObject defaultEncoder = encoderTypes.add<JsonObject>();
        defaultEncoder["name"] = "MT6701 SSI";
        defaultEncoder["value"] = BLDCEncoderType::MT6701;
        JsonObject PWM = encoderTypes.add<JsonObject>();
        PWM["name"] = "PWM";
        PWM["value"] = BLDCEncoderType::PWM;
        JsonObject SPI = encoderTypes.add<JsonObject>();
        SPI["name"] = "SPI";
        SPI["value"] = BLDCEncoderType::SPI;
#endif

        JsonArray lubeButtonPinModes = doc["lubeButtonPinModes"].to<JsonArray>();
        JsonObject lubePullUp = lubeButtonPinModes.add<JsonObject>();
        lubePullUp["name"] = "Pull-up";
        lubePullUp["value"] = LubeButtonPinMode::PULL_UP;
        JsonObject lubePullDown = lubeButtonPinModes.add<JsonObject>();
        lubePullDown["name"] = "Pull-down";
        lubePullDown["value"] = LubeButtonPinMode::PULL_DOWN;
        JsonObject lubeFloating = lubeButtonPinModes.add<JsonObject>();
        lubeFloating["name"] = "Floating";
        lubeFloating["value"] = LubeButtonPinMode::FLOAT;

        JsonArray bleDeviceTypes = doc["bleDeviceTypes"].to<JsonArray>();
        JsonObject defaultBleDevice = bleDeviceTypes.add<JsonObject>();
        defaultBleDevice["name"] = "TCode";
        defaultBleDevice["value"] = BLEDeviceType::TCODE;
        JsonObject loveDevice = bleDeviceTypes.add<JsonObject>();
        loveDevice["name"] = "Love";
        loveDevice["value"] = BLEDeviceType::LOVE;
        JsonObject hcDevice = bleDeviceTypes.add<JsonObject>();
        // HC has an unknown formatting.
        hcDevice["name"] = "HC";
        hcDevice["value"] = BLEDeviceType::HC;

        JsonArray bleLoveDevices = doc["bleLoveDeviceTypes"].to<JsonArray>();
        JsonObject defaultLoveDevice = bleLoveDevices.add<JsonObject>();
        defaultLoveDevice["name"] = "Edge";
        defaultLoveDevice["value"] = BLELoveDeviceType::EDGE;

        JsonArray availableChannels = doc["availableChannels"].to<JsonArray>();
        channelMap.serialize(availableChannels);
        doc[MOTION_ENABLED] = getMotionEnabled();
        // int motionProfileSelectedIndex = MOTION_PROFILE_SELECTED_INDEX_DEFAULT;
        // m_settingsFactory->getValue(MOTION_PROFILE_SELECTED_INDEX, motionProfileSelectedIndex);
        doc[MOTION_PROFILE_SELECTED_INDEX] = motionSelectedProfileIndex;

        JsonArray availableTimers = doc["availableTimers"].to<JsonArray>();
        JsonArray timerChannels = doc["timerChannels"].to<JsonArray>();
        JsonObject timerChannelNoneObj = timerChannels.add<JsonObject>();
        timerChannelNoneObj["name"] = "None";
        timerChannelNoneObj["value"] = ESPTimerChannelNum::NONE;
        PinMap *pinMap = m_settingsFactory->getPins();
        for (size_t i = 0; i < MAX_TIMERS; i++)
        {
            JsonObject timerObj = availableTimers.add<JsonObject>();
            ESPTimer *timer = pinMap->getTimer(i);
            timerObj["id"] = timer->id;
            timerObj["name"] = timer->name;
            timerObj["value"] = i;
            timerObj["pwmDriver"] = (int8_t)timer->pwmDriver;
            // Derive the driver setting key from the timer id so JS can write it back
            // e.g. "ESP_H_TIMER0_FREQUENCY" -> "ESP_H_TIMER0_DRIVER"
            String driverKey = String(timer->id);
            driverKey.replace("FREQUENCY", "DRIVER");
            timerObj["driverKey"] = driverKey;
            for (size_t j = 0; j < 2; j++)
            {
                JsonObject timerChannelObj = timerChannels.add<JsonObject>();
                timerChannelObj["name"] = timer->channels[j].name;
                timerChannelObj["value"] = timer->channels[j].channel;
                // Surface the timer's preferred PWM driver so the GUI can
                // relabel options as "LEDC:N" / "MCPWM:N" instead of the
                // old HIGH*/LOW* naming.
                timerChannelObj["driver"] = (int8_t)timer->pwmDriver;
            }
        }
        // MCPWM capacity: 2 groups × 3 operators × 2 generators = 12 max outputs
        doc["mcpwmMaxOutputs"] = 12;
        // LEDC capacity: 8 high-speed + 8 low-speed channels on ESP32; 8 on S3
#if CONFIG_IDF_TARGET_ESP32
        doc["ledcMaxOutputs"] = 16;
#else
        doc["ledcMaxOutputs"] = 8;
#endif

        doc["localIP"] = currentIP;
        doc["gateway"] = currentGateway;
        doc["subnet"] = currentSubnet;
        doc["dns1"] = currentDns1;
        doc["dns2"] = currentDns2; // Not being used currently
        char macTemp[18] = {0};
#ifdef ESP_ARDUINO3
        strlcpy(macTemp, Network.macAddress().c_str(), sizeof(macTemp));
#else
        strlcpy(macTemp, WiFi.macAddress().c_str(), sizeof(macTemp));
#endif
        doc["mac"] = macTemp;

        doc["chipModel"] = ESP.getChipModel();
        doc["chipRevision"] = ESP.getChipRevision();
        doc["chipCores"] = ESP.getChipCores();
        uint32_t chipId = 0;
        for (int i = 0; i < 17; i = i + 8)
        {
            chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
        }
        doc["chipID"] = chipId;

