jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
        doc["decoyPass"] = DECOY_PASS;
        doc["apMode"] = apMode;
        doc["defaultIP"] = m_settingsFactory->getAPModeIP();

        // Surface PWM attach failures so the GUI can flag the offending pins
        // (couldn't allocate any LEDC channel / MCPWM operator at the
        // requested freq+resolution after auto-fallback).
        {
            PwmManager& pm = PwmManager::instance();
            JsonArray pwmErrors = doc["pwmAttachErrors"].to<JsonArray>();
            const PwmManager::Failure* fails = pm.failures();
            for (int i = 0; i < pm.failureCount(); i++)
            {
                JsonObject e = pwmErrors.add<JsonObject>();
                e["name"] = fails[i].name;
                e["pin"] = fails[i].pin;
                e["freq"] = fails[i].freq;
                e["resolution"] = fails[i].resolution;
                e["triedFirst"] = (uint8_t)fails[i].triedFirst; // 1=MCPWM, 2=LEDC
            }
        }

        // Measure required size, then serialize into a single fixed-size heap
        // allocation. Serializing directly into a String causes ArduinoJson's
        // String writer to call String::concat() on every flush, which in turn
        // calls realloc() and can crash inside the allocator under heap
        // fragmentation pressure (especially as the payload has grown). One
        // malloc + one assignment avoids the realloc churn.
        size_t jsonLen = measureJson(doc);
        std::unique_ptr<char[]> raw(new (std::nothrow) char[jsonLen + 1]);
        if (!raw)
        {
            LogHandler::error(Tags::Settings, "getSystemInfo: failed to allocate %u bytes", (unsigned)(jsonLen + 1));
            buf = "";
            doc.clear();
            return;
        }
        size_t written = serializeJson(doc, raw.get(), jsonLen + 1);
        raw[written] = '\0';
        doc.clear();
        buf = raw.get();
        if (LogHandler::getLogLevel() == LogLevel::VERBOSE)
            Serial.printf("SystemInfo: %s\n", buf.c_str());
        // buf[0] = {0};
        // strcpy(buf, output.c_str());
    }

    static bool loadButtons(bool loadDefault, JsonObject json = JsonObject())
    {
        LogHandler::info(Tags::Settings, "Loading buttons");
        return loadSettingsJson(BUTTON_SETTINGS_PATH, loadDefault, m_buttonsMutex, [](const JsonObject json, bool &mutableLoadDefault) -> bool
                                {

            // const bool bootButtonEnabled = SettingsHandler::getValue<const bool>(BOOT_BUTTON_ENABLED);
            // const bool buttonSetsEnabled = SettingsHandler::getValue<const bool>(BUTTON_SETS_ENABLED);;
            // const char* bootButtonCommand =  SettingsHandler::getValue<const char*>(BOOT_BUTTON_COMMAND);;
            // const int buttonAnalogDebounce = SettingsHandler::getValue<const int>(BUTTON_ANALOG_DEBOUNCE);
            // setValue(json, bootButtonEnabled, "buttonCommand", "bootButtonEnabled", BOOT_BUTTON_ENABLED_DEFAULT);
            // setValue(json, buttonSetsEnabled, "buttonCommand", "buttonSetsEnabled", BOOT_BUTTON_COMMAND_DEFAULT);
            // setValue(json, bootButtonCommand, "buttonCommand", "bootButtonCommand", BUTTON_SETS_ENABLED_DEFAULT);
            // setValue(json, buttonAnalogDebounce, "buttonCommand", "buttonAnalogDebounce", BUTTON_ANALOG_DEBOUNCE_DEFAULT);
            if(!json.isNull())
            {
                bool bootButtonEnabled = json[BOOT_BUTTON_ENABLED] | BOOT_BUTTON_ENABLED_DEFAULT;
                m_settingsFactory->setValue(BOOT_BUTTON_ENABLED, bootButtonEnabled);
                bool buttonSetsEnabled = json[BUTTON_SETS_ENABLED] | BUTTON_SETS_ENABLED_DEFAULT;
                m_settingsFactory->setValue(BUTTON_SETS_ENABLED, buttonSetsEnabled);
                const char* bootButtonCommand = json[BOOT_BUTTON_COMMAND] | BOOT_BUTTON_COMMAND_DEFAULT;
                m_settingsFactory->setValue(BOOT_BUTTON_COMMAND, bootButtonCommand);
                int buttonAnalogDebounce = json[BUTTON_ANALOG_DEBOUNCE] | BUTTON_ANALOG_DEBOUNCE_DEFAULT;
                m_settingsFactory->setValue(BUTTON_ANALOG_DEBOUNCE, buttonAnalogDebounce);
                m_settingsFactory->saveCommon();
            }

            JsonArray buttonSetsObj = json["buttonSets"].as<JsonArray>();
            if(buttonSetsObj.isNull()) {
                LogHandler::info(Tags::Settings, "No button sets stored, loading default");
                mutableLoadDefault = true;
                const PinMap* pinMap = m_settingsFactory->getPins();
                for(int i = 0; i < MAX_BUTTON_SETS; i++) {
                    buttonSets[i] = ButtonSet();
                    buttonSets[i].pin = pinMap->buttonSetPin(i);

                    sprintf(buttonSets[i].name, "Button set %u", i+1);
                    LogHandler::debug(Tags::Settings, "Default buttonset name: %s, index: %u, pin: %ld", buttonSets[i].name, i, buttonSets[i].pin);
                    for(int j = 0; j < MAX_BUTTONS; j++) {
                        buttonSets[i].buttons[j] = ButtonModel();
                        buttonSets[i].buttons[j].loadDefault(j);
                        LogHandler::debug(Tags::Settings, "Default button name: %s, index: %u, command: %s", buttonSets[i].name, buttonSets[i].buttons[j].index, buttonSets[i].buttons[j].command);

                    }
                }
            } else {
                std::vector<int> pins;
                for(int i = 0; i < MAX_BUTTON_SETS; i++) {
                    auto set = ButtonSet();
                    set.fromJson(buttonSetsObj[i].as<JsonObject>());
                    pins.push_back(set.pin);
                    LogHandler::debug(Tags::Settings, "Loaded button set '%s', pin: %ld", set.name, set.pin);
                    buttonSets[i] = set;
                    for(int j = 0; j < MAX_BUTTONS; j++) {
                        LogHandler::debug(Tags::Settings, "Loaded button, name: %s, index: %u, command: %s", buttonSets[i].name, buttonSets[i].buttons[j].index, buttonSets[i].buttons[j].command);
                    }
                }
                m_settingsFactory->setValue(BUTTON_SET_PINS, pins);
                m_settingsFactory->savePins();
            }

