jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
                char buf[10];
                hexToString(address, buf);
                LogHandler::info(Tags::Settings, "I2C device found at address %s, byte %ld", buf, address);

                systemI2CAddresses.push_back((int)address);
                nDevices++;
            }
            else if (error == 4)
            {
                Serial.print("Unknow error at address 0x");
                if (address < 16)
                {
                    Serial.print("0");
                }
                Serial.println(address, HEX);
                // std::stringstream I2C_Address_String;
                // I2C_Address_String << "0x" << std::hex << address;
                // std::string foundAddress = I2C_Address_String.str();
                // LogHandler::error(Tags::Settings, "Unknow error at address %s", foundAddress);
            }
        }
        if (nDevices == 0)
        {
            LogHandler::info(Tags::Settings, "No I2C devices found");
            return false;
        }
        return true;
    }

    static Channel *getChannel(const char *name)
    {
        return channelMap.get(name);
    }

    static uint16_t getChannelMin(const char *name)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[getChannelMin] Invalid name for current map: %s", name);
            return TCODE_MIN;
        }
        return channelProfile->min;
    }

    static uint16_t getChannelMax(const char *name)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[getChannelMax] Invalid name for current map: %s", name);
            return TCODE_MAX;
        }
        return channelProfile->max;
    }

    static uint16_t getChannelUserMin(const char *name)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[getChannelUserMin] Invalid name for current map: %s", name);
            return TCODE_MIN;
        }
        return channelProfile->userMin;
    }

    static uint16_t getChannelUserMax(const char *name)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[getChannelUserMax] Invalid name for current map: %s", name);
            return TCODE_MAX;
        }
        return channelProfile->userMax;
    }

    static void setChannelMin(const char *name, uint16_t value)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[setChannelMin] Invalid name for current map: %s", name);
            return;
        }
        channelProfile->userMin = value;
    }

    static void setChannelMax(const char *name, uint16_t value)
    {
        Channel *channelProfile = channelMap.get(name);
        if (!channelProfile)
        {
            LogHandler::error(Tags::Settings, "[setChannelMax] Invalid name for current map: %s", name);
            return;
        }
        channelProfile->userMax = value;
    }

    static void setChannelRangesEnabled(bool enabled)
    {
        channelRangesEnabled = enabled;
        sendMessage(SettingProfile::ChannelRanges, "channelRangesEnabled");
    }
    static bool getChannelRangesEnabled()
    {
        return channelRangesEnabled;
    }

private:
    static SettingsFactory *m_settingsFactory;
    static SemaphoreHandle_t m_motionMutex;
    static SemaphoreHandle_t m_channelsMutex;
    static SemaphoreHandle_t m_wifiMutex;
    static SemaphoreHandle_t m_buttonsMutex;
    static SemaphoreHandle_t m_settingsMutex;
    static SETTING_STATE_FUNCTION_PTR_T message_callback;
    // Use http://arduinojson.org/assistant to compute the capacity.
    // static const size_t readCapacity = JSON_OBJECT_SIZE(100) + 2000;
    // static const size_t saveCapacity = JSON_OBJECT_SIZE(100);
    static const int deserializeSize = 32768;
    static const int serializeSize = 24576;
    // 3072

    static bool motionEnabled;
    static int motionSelectedProfileIndex;
    static int motionDefaultProfileIndex;
    // static MotionProfile motionProfiles[maxMotionProfileCount];

    // static bool voiceEnabled;
    // static bool voiceMuted;
    // static int voiceWakeTime ;
    // static int voiceVolume;

    //     static bool update(JsonObject json)
    //     {
    //         logLevel = (LogLevel)(json["logLevel"] | 2);
    //         LogHandler::setLogLevel(logLevel);
    //         LogHandler::debug(Tags::Settings, "Load Json: Memory usage: %u bytes", json.memoryUsage());

    //         boardType = (BoardType)(json["boardType"] | (uint8_t)BoardType::DEVKIT);

    //         if(isBoardType(BoardType::CRIMZZON) || isBoardType(BoardType::ISAAC)) {
    //             TCodeVersionEnum = TCodeVersion::v0_3;
    //             TCodeVersionName = TCodeVersionMapper(TCodeVersionEnum);
    //         }
    // std::vector<String> includesVec;
    // setValue(json, includesVec, "log", "log-include-tags");
    // LogHandler::setIncludes(includesVec);

    // std::vector<String> excludesVec;
    // setValue(json, excludesVec, "log", "log-exclude-tags");
    // LogHandler::setExcludes(excludesVec);

    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             TCodeVersionEnum = (TCodeVersion)(json["TCodeVersion"] | 1);
    //             TCodeVersionName = TCodeVersionMapper(TCodeVersionEnum);
    //         }

    //         channelMap.init(TCodeVersionEnum, motorType);

    // #if MOTOR_TYPE == 1
    //         for (auto x : ChannelMapBLDC) {
    //             currentChannels.push_back(x);
    //         }
    // #else
    //         currentChannels.clear();
    //         if(TCodeVersionEnum == TCodeVersion::v0_2) {
    //             // for (size_t i = 0; i < (sizeof(ChannelMapV2)/sizeof(Channel)); i++) {
    //             //     currentChannels.push_back(ChannelMapV2[i]);
    //             // }
    //             for (auto x : ChannelMapV2) {
    //                 currentChannels.push_back(x);
    //             }
    //         } else {
    //             for (auto x : ChannelMapV3) {
    //                 currentChannels.push_back(x);
    //             }
    //         }
    // #endif

