jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
    //         int tcodeMax = TCodeVersionEnum == TCodeVersion::v0_2 ? 999 : 9999;
    //         for (size_t i = 0; i < currentChannels.size(); i++)
    //         {
    //             uint16_t min = json["channelRanges"][currentChannels[i].Name]["min"].as<uint16_t>();
    //             uint16_t max = json["channelRanges"][currentChannels[i].Name]["max"].as<uint16_t>();
    //             currentChannels[i].min = !min ? 1 : min;
    //             currentChannels[i].max = !max ? tcodeMax : max;
    //         }

    //         sendMessage("channelRanges", "channelRanges");// TODO: channelranges should be in its own json

    //         udpServerPort = json["udpServerPort"] | 8000;
    //         webServerPort = json["webServerPort"] | 80;
    //         const char *hostnameTemp = json["hostname"] | "tcode";
    //         if (hostnameTemp != nullptr)
    //             strcpy(hostname, hostnameTemp);
    //         const char *friendlyNameTemp = json["friendlyName"] | "ESP32 TCode";
    //         if (friendlyNameTemp != nullptr)
    //             strcpy(friendlyName, friendlyNameTemp);

    //         bluetoothEnabled = json["bluetoothEnabled"] | false;

    //         // Servo motors//////////////////////////////////////////////////////////////////////////////////
    //         pitchFrequencyIsDifferent = json["pitchFrequencyIsDifferent"];
    //         msPerRad = json["msPerRad"] | 637;
    //         servoFrequency = json["servoFrequency"] | 50;
    //         pitchFrequency = json[pitchFrequencyIsDifferent ? "pitchFrequency" : "servoFrequency"] | servoFrequency;
    //         sr6Mode = json["sr6Mode"];

    //         RightServo_ZERO = json["RightServo_ZERO"] | 1500;
    //         LeftServo_ZERO = json["LeftServo_ZERO"] | 1500;
    //         RightUpperServo_ZERO = json["RightUpperServo_ZERO"] | 1500;
    //         LeftUpperServo_ZERO = json["LeftUpperServo_ZERO"] | 1500;
    //         PitchLeftServo_ZERO = json["PitchLeftServo_ZERO"] | 1500;
    //         PitchRightServo_ZERO = json["PitchRightServo_ZERO"] | 1500;

    //         BLDC_UsePWM = json["BLDC_UsePWM"] | false; // Must be before pinout is set
    //         BLDC_UseMT6701 = json["BLDC_UseMT6701"] | true;
    //         BLDC_UseHallSensor = json["BLDC_UseHallSensor"] | false;
    //         BLDC_Pulley_Circumference = json["BLDC_Pulley_Circumference"] | 60;
    //         BLDC_MotorA_Voltage = round2(json["BLDC_MotorA_Voltage"] | 20.0);
    //         BLDC_MotorA_Current = round2(json["BLDC_MotorA_Current"] | 1.0);
    //         BLDC_MotorA_ParametersKnown = json["BLDC_MotorA_ParametersKnown"] | false;
    //         BLDC_MotorA_ZeroElecAngle = round2(json["BLDC_MotorA_ZeroElecAngle"] | 0.00);
    //         BLDC_RailLength = json["BLDC_RailLength"] | 125;
    //         BLDC_StrokeLength = json["BLDC_StrokeLength"] | 120;

    //         setBoardPinout(json);

    //         if(isBoardType(BoardType::CRIMZZON)) {
    //             heaterResolution = json["heaterResolution"] | 8;
    //             caseFanResolution = json["caseFanResolution"] | 10;
    //             caseFanFrequency = json["caseFanFrequency"] | 25;
    //             Display_Screen_Height = json["Display_Screen_Height"] | 32;
    //         }

    //         twistFrequency = json["twistFrequency"] | 50;
    //         squeezeFrequency = json["squeezeFrequency"] | 50;
    //         valveFrequency = json["valveFrequency"] | 50;
    //         continuousTwist = json["continuousTwist"];
    //         feedbackTwist = json["feedbackTwist"];
    //         analogTwist = json["analogTwist"];
    //         TwistServo_ZERO = json["TwistServo_ZERO"] | 1500;
    //         ValveServo_ZERO = json["ValveServo_ZERO"] | 1500;
    //         SqueezeServo_ZERO = json["Squeeze_ZERO"] | 1500;

    //         staticIP = json["staticIP"];
    //         const char *localIPTemp = json["localIP"] | "192.168.0.150";
    //         if (localIPTemp != nullptr)
    //             strcpy(localIP, localIPTemp);
    //         const char *gatewayTemp = json["gateway"] | "192.168.0.1";
    //         if (gatewayTemp != nullptr)
    //             strcpy(gateway, gatewayTemp);
    //         const char *subnetTemp = json["subnet"] | "255.255.255.0";
    //         if (subnetTemp != nullptr)
    //             strcpy(subnet, subnetTemp);
    //         const char *dns1Temp = json["dns1"] | "8.8.8.8";
    //         if (dns1Temp != nullptr)
    //             strcpy(dns1, dns1Temp);
    //         const char *dns2Temp = json["dns2"] | "8.8.4.4";
    //         if (dns2Temp != nullptr)
    //             strcpy(dns2, dns2Temp);

    //         autoValve = json["autoValve"];
    //         inverseValve = json["inverseValve"];
    //         valveServo90Degrees = json["valveServo90Degrees"];
    //         inverseStroke = json["inverseStroke"];
    //         inversePitch = json["inversePitch"];
    //         lubeEnabled = json["lubeEnabled"];
    //         lubeAmount = json["lubeAmount"] | 255;
    //         displayEnabled = json["displayEnabled"] | true;
    //         sleeveTempDisplayed = json["sleeveTempDisplayed"];
    //         internalTempDisplayed = json["internalTempDisplayed"];
    //         versionDisplayed = json["versionDisplayed"] | true;
    //         Display_Screen_Width = json["Display_Screen_Width"] | 128;
    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             Display_Screen_Height = json["Display_Screen_Height"] | 64;
    //         }
    //         const char *Display_I2C_AddressTemp = json["Display_I2C_Address"] | "0x3c";
    //         if (Display_I2C_AddressTemp != nullptr)
    //             Display_I2C_Address = (int)strtol(Display_I2C_AddressTemp, NULL, 0);
    //         Display_Rst_PIN = json["Display_Rst_PIN"] | -1;

    //         tempSleeveEnabled = json["tempSleeveEnabled"];
    //         heaterThreshold = json["heaterThreshold"] | 5.0;
    //         heaterFrequency = json["heaterFrequency"] | 50;
    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             heaterResolution = json["heaterResolution"] | 8;
    //         }
    //         TargetTemp = json["TargetTemp"] | 40.0;
    //         HeatPWM = json["HeatPWM"] | 255;
    //         HoldPWM = json["HoldPWM"] | 110;

    //         tempInternalEnabled = json["tempInternalEnabled"];
    //         fanControlEnabled = json["fanControlEnabled"];
    //         internalTempForFan = json["internalTempForFan"] | 30.0;
    //         internalMaxTemp = json["internalMaxTemp"] | 50.0;

    //         batteryLevelEnabled = json["batteryLevelEnabled"];
    //         batteryLevelNumeric = json["batteryLevelNumeric"];
    //         batteryVoltageMax = json["batteryVoltageMax"] | 12.6;
    //         batteryCapacityMax = json["batteryCapacityMax"] | 3500;

    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             caseFanFrequency = json["caseFanFrequency"] | 25;
    //             caseFanResolution = json["caseFanResolution"] | 10;
    //         }
    //         caseFanMaxDuty = pow(2, caseFanResolution) - 1;

    //         lubeEnabled = json["lubeEnabled"];

    //         setValue(json, voiceEnabled, "voiceHandler", "voiceEnabled", false);
    //         setValue(json, voiceMuted, "voiceHandler", "voiceMuted", false);
    //         setValue(json, voiceVolume, "voiceHandler", "voiceVolume", 0);
    //         setValue(json, voiceWakeTime, "voiceHandler", "voiceWakeTime", 10);

    //         lastRebootReason = machine_reset_cause();
    //         LogHandler::debug(Tags::Settings, "Last reset reason: %s", SettingsHandler::lastRebootReason);

    //         LogUpdateDebug();
    //         return true;
    //     }

    //     static bool compileCommonJsonDocument(DynamicJsonDocument& doc)
    //     {
    //         // LogHandler::info(Tags::Settings, "Save settings");
    //         // Delete existing file, otherwise the configuration is appended to the file
    //         // Serial.print("LittleFS used: ");
    //         // Serial.println(LittleFS.usedBytes() + "/" + LittleFS.totalBytes());
    //         // if (!LittleFS.remove(userSettingsFilePath))
    //         // {
    //         //     LogHandler::error(Tags::Settings, "Failed to remove settings file: %s", userSettingsFilePath);
    //         // }
    //         // File file = LittleFS.open(userSettingsFilePath, FILE_WRITE);
    //         // if (!file)
    //         // {
    //         //     LogHandler::error(Tags::Settings, "Failed to create settings file: %s", userSettingsFilePath);
    //         //     return false;
    //         // }

    //         // // Allocate a temporary docdocument
    //         // DynamicdocDocument doc(serializeSize);

    //         doc["boardType"] = (uint8_t)boardType;
    //         doc["logLevel"] = (int)logLevel;
    //         LogHandler::setLogLevel(logLevel);
    //         // Serial.println("logLevel: ");
    //         // Serial.println((int)logLevel);
    //         // Serial.println( doc["logLevel"] .as<int>());
    //         // Serial.println((int)doc["logLevel"]);

    //         // std::vector<const char*> tags;
    //         //  tags.push_back(Tags::DisplayHandler);
    //         //  tags.push_back(Tags::BLDCHandler);
    //         //  tags.push_back(Tags::ServoHandler3);
    //         // LogHandler::setTags(tags);

    //         for (size_t i = 0; i < currentChannels.size(); i++)
    //         {
    //             doc["channelRanges"][currentChannels[i].Name]["min"] = currentChannels[i].min;
    //             doc["channelRanges"][currentChannels[i].Name]["max"] = currentChannels[i].max;
    //             // LogHandler::debug(Tags::Settings, "save %s min: %i", currentChannels[i].Name, doc["channelRanges"][currentChannels[i].Name]["min"].as<int>());
    //             // LogHandler::debug(Tags::Settings, "save %s max: %i", currentChannels[i].Name, doc["channelRanges"][currentChannels[i].Name]["max"].as<int>());
    //         }

