jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
    //         if (!tempInternalEnabled)
    //         {
    //             internalTempDisplayed = false;
    //             fanControlEnabled = false;
    //         }
    //         if (!tempSleeveEnabled)
    //         {
    //             sleeveTempDisplayed = false;
    //         }
    //         doc["fullBuild"] = fullBuild;
    //         doc["TCodeVersion"] = (int)TCodeVersionEnum;

    //         doc["udpServerPort"] = udpServerPort;
    //         doc["webServerPort"] = webServerPort;
    //         doc["hostname"] = hostname;
    //         doc["friendlyName"] = friendlyName;
    //         doc["bluetoothEnabled"] = bluetoothEnabled;
    //         doc["pitchFrequencyIsDifferent"] = pitchFrequencyIsDifferent;
    //         doc["msPerRad"] = msPerRad;
    //         doc["servoFrequency"] = servoFrequency;
    //         doc["pitchFrequency"] = pitchFrequency;
    //         doc["valveFrequency"] = valveFrequency;
    //         doc["twistFrequency"] = twistFrequency;
    //         doc["squeezeFrequency"] = squeezeFrequency;
    //         doc["continuousTwist"] = continuousTwist;
    //         doc["feedbackTwist"] = feedbackTwist;
    //         doc["analogTwist"] = analogTwist;
    //         doc["TwistFeedBack_PIN"] = TwistFeedBack_PIN;
    //         doc["RightServo_PIN"] = RightServo_PIN;
    //         doc["LeftServo_PIN"] = LeftServo_PIN;
    //         doc["RightUpperServo_PIN"] = RightUpperServo_PIN;
    //         doc["LeftUpperServo_PIN"] = LeftUpperServo_PIN;
    //         doc["PitchLeftServo_PIN"] = PitchLeftServo_PIN;
    //         doc["PitchRightServo_PIN"] = PitchRightServo_PIN;
    //         doc["ValveServo_PIN"] = ValveServo_PIN;
    //         doc["TwistServo_PIN"] = TwistServo_PIN;
    //         doc["Squeeze_PIN"] = Squeeze_PIN;
    //         doc["Vibe0_PIN"] = Vibe0_PIN;
    //         doc["Vibe1_PIN"] = Vibe1_PIN;
    //         doc["Vibe2_PIN"] = Vibe2_PIN;
    //         doc["Vibe3_PIN"] = Vibe3_PIN;
    //         doc["Case_Fan_PIN"] = Case_Fan_PIN;
    //         doc["LubeButton_PIN"] = LubeButton_PIN;
    //         doc["Internal_Temp_PIN"] = Internal_Temp_PIN;

    //         doc["BLDC_UsePWM"] = BLDC_UsePWM;
    //         doc["BLDC_UseMT6701"] = BLDC_UseMT6701;
    //         doc["BLDC_UseHallSensor"] = BLDC_UseHallSensor;
    //         doc["BLDC_Pulley_Circumference"] = BLDC_Pulley_Circumference;
    //         doc["BLDC_Encoder_PIN"] = BLDC_Encoder_PIN;
    //         doc["BLDC_ChipSelect_PIN"] = BLDC_ChipSelect_PIN;
    //         doc["BLDC_Enable_PIN"] = BLDC_Enable_PIN;
    //         doc["BLDC_HallEffect_PIN"] = BLDC_HallEffect_PIN;
    //         doc["BLDC_PWMchannel1_PIN"] = BLDC_PWMchannel1_PIN;
    //         doc["BLDC_PWMchannel2_PIN"] = BLDC_PWMchannel2_PIN;
    //         doc["BLDC_PWMchannel3_PIN"] = BLDC_PWMchannel3_PIN;
    //         doc["BLDC_MotorA_Voltage"] = round2(BLDC_MotorA_Voltage);
    //         doc["BLDC_MotorA_Current"] = round2(BLDC_MotorA_Current);
    //         doc["BLDC_MotorA_ParametersKnown"] = BLDC_MotorA_ParametersKnown;
    //         doc["BLDC_MotorA_ZeroElecAngle"] = round2(BLDC_MotorA_ZeroElecAngle);
    //         doc["BLDC_RailLength"] = BLDC_RailLength;
    //         doc["BLDC_StrokeLength"] = BLDC_StrokeLength;

    //         LogHandler::debug(Tags::Settings, "save %s max: %f", "BLDC_MotorA_Voltage", doc["BLDC_MotorA_Current"].as<float>());

    //         doc["staticIP"] = staticIP;
    //         doc["localIP"] = localIP;
    //         doc["gateway"] = gateway;
    //         doc["subnet"] = subnet;
    //         doc["dns1"] = dns1;
    //         doc["dns2"] = dns2;

    //         doc["sr6Mode"] = sr6Mode;
    //         doc["RightServo_ZERO"] = RightServo_ZERO;
    //         doc["LeftServo_ZERO"] = LeftServo_ZERO;
    //         doc["RightUpperServo_ZERO"] = RightUpperServo_ZERO;
    //         doc["LeftUpperServo_ZERO"] = LeftUpperServo_ZERO;
    //         doc["PitchLeftServo_ZERO"] = PitchLeftServo_ZERO;
    //         doc["PitchRightServo_ZERO"] = PitchRightServo_ZERO;
    //         doc["TwistServo_ZERO"] = TwistServo_ZERO;
    //         doc["ValveServo_ZERO"] = ValveServo_ZERO;
    //         doc["Squeeze_ZERO"] = SqueezeServo_ZERO;
    //         doc["autoValve"] = autoValve;
    //         doc["inverseValve"] = inverseValve;
    //         doc["valveServo90Degrees"] = valveServo90Degrees;
    //         doc["inverseStroke"] = inverseStroke;
    //         doc["inversePitch"] = inversePitch;
    //         doc["lubeAmount"] = lubeAmount;
    //         doc["lubeEnabled"] = lubeEnabled;
    //         doc["displayEnabled"] = displayEnabled;
    //         doc["sleeveTempDisplayed"] = sleeveTempDisplayed;
    //         doc["versionDisplayed"] = versionDisplayed;
    //         doc["internalTempDisplayed"] = internalTempDisplayed;
    //         doc["tempSleeveEnabled"] = tempSleeveEnabled;
    //         doc["Display_Screen_Width"] = Display_Screen_Width;
    //         doc["Display_Screen_Height"] = Display_Screen_Height;
    //         doc["TargetTemp"] = TargetTemp;
    //         doc["HeatPWM"] = HeatPWM;
    //         doc["HoldPWM"] = HoldPWM;
    //         std::stringstream Display_I2C_Address_String;
    //         Display_I2C_Address_String << "0x" << std::hex << Display_I2C_Address;
    //         doc["Display_I2C_Address"] = Display_I2C_Address_String.str();
    //         doc["Display_Rst_PIN"] = Display_Rst_PIN;
    //         doc["Temp_PIN"] = Sleeve_Temp_PIN;
    //         doc["Heater_PIN"] = Heater_PIN;
    //         // doc["heaterFailsafeTime"] = String(heaterFailsafeTime);
    //         doc["heaterThreshold"] = heaterThreshold;
    //         doc["heaterResolution"] = heaterResolution;
    //         doc["heaterFrequency"] = heaterFrequency;
    //         doc["fanControlEnabled"] = fanControlEnabled;
    //         doc["caseFanFrequency"] = caseFanFrequency;
    //         doc["caseFanResolution"] = caseFanResolution;
    //         doc["internalTempForFan"] = internalTempForFan;
    //         doc["internalMaxTemp"] = internalMaxTemp;
    //         doc["tempInternalEnabled"] = tempInternalEnabled;

    //         doc["batteryLevelEnabled"] = batteryLevelEnabled;
    //         //doc["Battery_Voltage_PIN"] = Battery_Voltage_PIN;
    //         doc["batteryLevelNumeric"] = batteryLevelNumeric;
    //         doc["batteryVoltageMax"] = round2(batteryVoltageMax);
    //         doc["batteryCapacityMax"] = batteryCapacityMax;

    //         doc["voiceEnabled"] = voiceEnabled;
    //         doc["voiceMuted"] = voiceMuted;
    //         doc["voiceWakeTime"] = voiceWakeTime;
    //         doc["voiceVolume"] = voiceVolume;

    //         JsonArray includes = doc.createNestedArray("log-include-tags");
    //         std::vector<String> includesVec = LogHandler::getIncludes();
    //         for (int i = 0; i < includesVec.size(); i++)
    //         {
    //             includes.add(includesVec[i]);
    //         }

    //         JsonArray excludes = doc.createNestedArray("log-exclude-tags");
    //         std::vector<String> excludesVec = LogHandler::getExcludes();
    //         for (int i = 0; i < excludesVec.size(); i++)
    //         {
    //             excludes.add(excludesVec[i]);
    //         }

    //         LogHandler::debug(Tags::Settings, "isNull: %u", doc.isNull());
    //         if (doc.isNull())
    //         {
    //             LogHandler::error(Tags::Settings, "document is null!");
    //             // file.close();
    //             return false;
    //         }

    //         LogHandler::debug(Tags::Settings, "Memory usage: %u bytes", doc.memoryUsage());
    //         if (doc.memoryUsage() == 0)
    //         {
    //             LogHandler::error(Tags::Settings, "document is empty!");
    //             // file.close();
    //             return false;
    //         }

