jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
    //         LogHandler::debug(Tags::Settings, "Is overflowed: %u", doc.overflowed());
    //         if (doc.overflowed())
    //         {
    //             LogHandler::error(Tags::Settings, "document is overflowed! Increase serialize size: %u", doc.memoryUsage());
    //             // file.close();
    //             return false;
    //         }

    //         return true;
    //     }

    /// @brief Locks the mutex checks for an existing file and creates  it if it doesnt exist. Calls the callback function and gives the mutex.
    /// @param filepath
    /// @param mutableLoadDefault
    /// @param mutex
    /// @param jsonSize
    /// @param loadFunction
    /// @param json
    /// @return
    static bool loadSettingsJson(const char *filepath, bool loadDefault, SemaphoreHandle_t &mutex, std::function<bool(const JsonObject, bool &mutableLoadDefault)> loadFunction, std::function<bool(JsonObject)> saveFunction, JsonObject json = JsonObject())
    {
        JsonDocument doc; // jsonSize
        bool mutableLoadDefault = loadDefault;
        if (mutableLoadDefault || json.isNull())
        {
            xSemaphoreTake(mutex, portMAX_DELAY);
            if (!checkForFileAndLoad(filepath, doc, mutableLoadDefault))
            {
                xSemaphoreGive(mutex);
                return false;
            }
            json = doc.as<JsonObject>();
        }
        if (!loadFunction(json, mutableLoadDefault))
        {
            xSemaphoreGive(mutex);
            return false;
        }
        xSemaphoreGive(mutex);
        if (mutableLoadDefault)
            saveFunction(JsonObject());
        return true;
    }

    /// @brief Locks the mutex and validates the file exists. calls the calback and serializes the data in a file to disk. Releases the mutex.
    /// @param filepath
    /// @param mutex
    /// @param jsonSize
    /// @param saveFunction
    /// @param json
    /// @return
    static bool saveSettingsJson(const char *filepath, SemaphoreHandle_t &mutex, int jsonSize, std::function<bool(JsonDocument &)> saveFunction, std::function<bool(bool, JsonObject)> loadFunction, JsonObject json = JsonObject())
    {
        saving = true;
        xSemaphoreTake(mutex, portMAX_DELAY);
        LogHandler::debug(Tags::Settings, "Saving File: %s", filepath);
        bool loadBeforeSetting = false;
        if (!LittleFS.exists(filepath))
        {
            LogHandler::error(Tags::Settings, "File did not exist whan saving: %s", filepath);
            xSemaphoreGive(mutex);
            saving = false;
            return false;
        }
        else
        {
            if (!json.isNull())
            {
                LogHandler::debug(Tags::Settings, "Loading from input json: %s", filepath);
                xSemaphoreGive(mutex);
                if (!loadFunction(false, json))
                {
                    LogHandler::error(Tags::Settings, "File loading input json failed: %s", filepath);
                    return false;
                }
                xSemaphoreTake(mutex, portMAX_DELAY);
            }
            LogHandler::debug(Tags::Settings, "jsonSize: %ld", jsonSize);
            JsonDocument doc; // jsonSize
            if (!saveFunction(doc))
            {
                LogHandler::error(Tags::Settings, "Failed to compile JSON object: %s", filepath);
                xSemaphoreGive(mutex);
                saving = false;
                return false;
            }
            LogHandler::debug(Tags::Settings, "Doc overflowed: %u", doc.overflowed());
            // LogHandler::debug(Tags::Settings, "Doc memory: %u", doc.memoryUsage());
            // LogHandler::debug(Tags::Settings, "Doc capacity: %u", doc.capacity());
            File file = LittleFS.open(filepath, FILE_WRITE);
            if (serializeJson(doc, file) == 0)
            {
                LogHandler::error(Tags::Settings, "Failed to write to file: %s", filepath);
                file.close();
                xSemaphoreGive(mutex);
                saving = false;
                return false;
            }
            LogHandler::debug(Tags::Settings, "File contents: %s", file.readString().c_str());
            file.close();
            printFree();
        }
        saving = false;
        xSemaphoreGive(mutex);
        return true;
    }

    static bool checkForFileAndLoad(const char *path, JsonDocument &doc, bool &loadDefault)
    {
        if (!LittleFS.exists(path))
        {
            loadDefault = true;
        }
        if (loadDefault)
        {
            defaultJsonFile(path);
        }
        return loadJsonFromFile(path, doc);
    }

    static bool defaultJsonFile(const char *path)
    {
        LogHandler::debug(Tags::Settings, "Defaulting file %s", path);
        if (LittleFS.exists(path))
        {
            LogHandler::debug(Tags::Settings, "Deleting file %s", path);
            if (!LittleFS.remove(path))
            {
                LogHandler::error(Tags::Settings, "Error deleting %s!", path);
                return false;
            }
        }
        LogHandler::debug(Tags::Settings, "Creating file %s", path);
        File newFile = LittleFS.open(path, FILE_WRITE, true);
        if (!newFile)
        {
            LogHandler::error(Tags::Settings, "Error creating %s!", path);
            return false;
        }
        newFile.print("{}");
        newFile.flush();
        newFile.close();
        return true;
    }

    static bool loadJsonFromFile(const char *path, JsonDocument &doc)
    {
        LogHandler::debug(Tags::Settings, "Loading json file %s", path);
        if (!LittleFS.exists(path))
        {
            LogHandler::error(Tags::Settings, "%s did not exist!", path);
            return false;
        }

        File file = LittleFS.open(path, FILE_READ);
        if (!file)
        {
            LogHandler::error(Tags::Settings, "%s failed to open!", path);
            return false;
        }
        if (LogDeserializationError(deserializeJson(doc, file), file.name()))
        {
            file.close();
            return false;
        }
        file.close();
        return true;
    }

    static bool LogDeserializationError(DeserializationError error, const char *filename)
    {
        if (error)
        {
            LogHandler::error(Tags::Settings, "Error deserializing json: %s", filename);
            switch (error.code())
            {
            case DeserializationError::Code::Ok:
                LogHandler::error(Tags::Settings, "Code: Ok");
                break;
            case DeserializationError::Code::EmptyInput:
                LogHandler::error(Tags::Settings, "Code: EmptyInput");
                break;
            case DeserializationError::Code::IncompleteInput:
                LogHandler::error(Tags::Settings, "Code: IncompleteInput");
                break;
            case DeserializationError::Code::InvalidInput:
                LogHandler::error(Tags::Settings, "Code: InvalidInput");
                break;
            case DeserializationError::Code::NoMemory:
                LogHandler::error(Tags::Settings, "Code: NoMemory");
                break;
            case DeserializationError::Code::TooDeep:
                LogHandler::error(Tags::Settings, "Code: TooDeep");
                break;
            }
            return true;
        }
        return false;
    }
    //     /** If the parameter json is ommited or the pin value doesnt exist on the object then the pins are set to default. */
    //     static void setBoardPinout(JsonObject json = JsonObject()) {

    // #if MOTOR_TYPE == 0
    //     if(isBoardType(BoardType::ISAAC)) {
    //         // RightServo_PIN = 2;
    //         // LeftServo_PIN = 13;
    //         // PitchLeftServo_PIN = 14;
    //         // ValveServo_PIN = 5;
    //         // TwistServo_PIN = 27;
    //         // TwistFeedBack_PIN = 33;
    //         // Vibe0_PIN = 15;
    //         // Vibe1_PIN = 16;
    //         // LubeButton_PIN = 36;
    //         // RightUpperServo_PIN = 4;
    //         // LeftUpperServo_PIN = 12;
    //         // PitchRightServo_PIN = 17;
    //         // Sleeve_Temp_PIN = 25;
    //         // Heater_PIN = 19;
    //         // Squeeze_PIN = 26;
    //         TwistFeedBack_PIN = json["TwistFeedBack_PIN"] | 32;
    //         RightServo_PIN = json["RightServo_PIN"] | 4;
    //         LeftServo_PIN = json["LeftServo_PIN"] | 13;
    //         RightUpperServo_PIN = json["RightUpperServo_PIN"] | 16;
    //         LeftUpperServo_PIN = json["LeftUpperServo_PIN"] | 27;
    //         PitchLeftServo_PIN = json["PitchLeftServo_PIN"] | 26;
    //         PitchRightServo_PIN = json["PitchRightServo_PIN"] | 17;
    //         ValveServo_PIN = json["ValveServo_PIN"] | 18;
    //         TwistServo_PIN = json["TwistServo_PIN"] | 25;
    //         // Common motor
    //         Squeeze_PIN = json["Squeeze_PIN"] | 19;
    //         LubeButton_PIN = json["LubeButton_PIN"] | 34;
    //         // Internal_Temp_PIN = json["Internal_Temp_PIN"] | 34;
    //         Sleeve_Temp_PIN = json["Temp_PIN"] | 33;
    //         // Case_Fan_PIN = json["Case_Fan_PIN"] | 16;
    //         Vibe0_PIN = json["Vibe0_PIN"] | 15;
    //         Vibe1_PIN = json["Vibe1_PIN"] | 2;
    //         // Vibe2_PIN = json["Vibe2_PIN"] | 23;
    //         // Vibe3_PIN = json["Vibe3_PIN"] | 32;
    //         Heater_PIN = json["Heater_PIN"] | 5;
    //     } else if(isBoardType(BoardType::CRIMZZON)) {

    //         Vibe3_PIN = json["Vibe3_PIN"] | 26;
    //         Internal_Temp_PIN = json["Internal_Temp_PIN"] | 32;

    //         // EXT
    //         //  EXT_Input2_PIN = 34;
    //         //  EXT_Input3_PIN = 39;
    //         //  EXT_Input4_PIN = 36;

    //         heaterResolution = json["heaterResolution"] | 8;
    //         caseFanResolution = json["caseFanResolution"] | 10;
    //         caseFanFrequency = json["caseFanFrequency"] | 25;
    //         Display_Screen_Height = json["Display_Screen_Height"] | 32;
    //         TwistFeedBack_PIN = json["TwistFeedBack_PIN"] | 0;
    //     }
    //     if(!isBoardType(BoardType::ISAAC)) { // Devkit v1 pins
    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             TwistFeedBack_PIN = json["TwistFeedBack_PIN"] | 26;
    //         }
    //         // Common motor
    //         Squeeze_PIN = json["Squeeze_PIN"] | 17;
    //         LubeButton_PIN = json["LubeButton_PIN"] | 35;
    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             Internal_Temp_PIN = json["Internal_Temp_PIN"] | 34;
    //         }
    //         Case_Fan_PIN = json["Case_Fan_PIN"] | 16;

    //         //Stock servo motors
    //         RightServo_PIN = json["RightServo_PIN"] | 13;
    //         LeftServo_PIN = json["LeftServo_PIN"] | 15;
    //         RightUpperServo_PIN = json["RightUpperServo_PIN"] | 12;
    //         LeftUpperServo_PIN = json["LeftUpperServo_PIN"] | 2;
    //         PitchLeftServo_PIN = json["PitchLeftServo_PIN"] | 4;
    //         PitchRightServo_PIN = json["PitchRightServo_PIN"] | 14;

    //         Heater_PIN = json["Heater_PIN"] | 33;
    //         ValveServo_PIN = json["ValveServo_PIN"] | 25;
    //         TwistServo_PIN = json["TwistServo_PIN"] | 27;
    //         Sleeve_Temp_PIN = json["Temp_PIN"] | 5;
    //         Vibe0_PIN = json["Vibe0_PIN"] | 18;
    //         Vibe1_PIN = json["Vibe1_PIN"] | 19;
    //         Vibe2_PIN = json["Vibe2_PIN"] | 23;
    //         if(!isBoardType(BoardType::CRIMZZON)) {
    //             Vibe3_PIN = json["Vibe3_PIN"] | 32;
    //         }
    //     }
    // #elif MOTOR_TYPE == 1
    //         // BLDC motor
    //         BLDC_Encoder_PIN = json["BLDC_Encoder_PIN"] | 33;
    //         BLDC_ChipSelect_PIN = json["BLDC_ChipSelect_PIN"] | 5;
    //         BLDC_Enable_PIN = json["BLDC_Enable_PIN"] | 14;
    //         BLDC_PWMchannel1_PIN = json["BLDC_PWMchannel1_PIN"] | 27;
    //         BLDC_PWMchannel2_PIN = json["BLDC_PWMchannel2_PIN"] | 26;
    //         BLDC_PWMchannel3_PIN = json["BLDC_PWMchannel3_PIN"] | 25;

    //         // PWM
    //         Heater_PIN = json["Heater_PIN"] | 15;
    //         Sleeve_Temp_PIN = json["Temp_PIN"] | 36;
    //         Vibe0_PIN = json["Vibe0_PIN"] | 2;
    //         Vibe1_PIN = json["Vibe1_PIN"] | 4;
    //         Vibe2_PIN = json["Vibe2_PIN"] | -1;
    //         Vibe3_PIN = json["Vibe3_PIN"] | -1;
    //         Case_Fan_PIN = json["Case_Fan_PIN"] | 16;

    //         // PWM servo
    //         ValveServo_PIN = json["ValveServo_PIN"] | 12;
    //         TwistServo_PIN = json["TwistServo_PIN"] | 13;
    //         Squeeze_PIN = json["Squeeze_PIN"] | 17;

    //         // Input
    //         TwistFeedBack_PIN = json["TwistFeedBack_PIN"] | 26;
    //         LubeButton_PIN = json["LubeButton_PIN"] | 35;
    //         Internal_Temp_PIN = json["Internal_Temp_PIN"] | 34;
    //         BLDC_HallEffect_PIN = json["BLDC_HallEffect_PIN"] | 35;
    // #endif
    // }

    static void setBuildFeatures()
    {
        int index = 0;
#if WIFI_TCODE
        LOG_BUILD_FEATURE(WIFI_TCODE);
        buildFeatures[index] = BuildFeature::WIFI;
        index++;
#endif
#if BLUETOOTH_TCODE
        LOG_BUILD_FEATURE(BLUETOOTH_TCODE);
        buildFeatures[index] = BuildFeature::BLUETOOTH;
        index++;
#endif
#if BLE_TCODE
        LOG_BUILD_FEATURE(BLE_TCODE);
        buildFeatures[index] = BuildFeature::BLE;
        index++;
#endif
#if DEBUG_BUILD
        LOG_BUILD_FEATURE(DEBUG_BUILD);
        buildFeatures[index] = BuildFeature::DEBUG;
        index++;
#endif
#ifdef ESP32_DA
        LOG_BUILD_FEATURE(ESP32_DA);
        buildFeatures[index] = BuildFeature::DA;
        index++;
#endif
#if BUILD_TEMP
        LOG_BUILD_FEATURE(BUILD_TEMP);
        buildFeatures[index] = BuildFeature::TEMP;
        index++;
#endif
#if BUILD_DISPLAY
        LOG_BUILD_FEATURE(BUILD_DISPLAY);
        buildFeatures[index] = BuildFeature::DISPLAY_;
        index++;
#endif
// #if TCODE_V2
//         LogHandler::debug("setBuildFeatures", "TCODE_V2");
//         buildFeatures[index] = BuildFeature::HAS_TCODE_V2;
//         index++;
// #endif
#if SECURE_WEB
        LOG_BUILD_FEATURE(HTTPS);
        buildFeatures[index] = BuildFeature::HTTPS;
        index++;
#endif
#if COEXIST
        LOG_BUILD_FEATURE(COEXIST);
        buildFeatures[index] = BuildFeature::COEXIST_FEATURE;
        index++;
#endif
        buildFeatures[(int)BuildFeature::MAX_FEATURES - 1] = {};
    }

    static void setMotorType()
    {
#if MOTOR_TYPE == 0
        m_settingsFactory->setValue(MOTOR_TYPE_SETTING, (int)MotorType::Servo);
#elif MOTOR_TYPE == 1
        m_settingsFactory->setValue(MOTOR_TYPE_SETTING, (int)MotorType::BLDC);
#endif
    }

