jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
    // static void LogSaveDebug(const DynamicJsonDocument doc)
    // {
    // Commented out due to error in logger on hostname.
    // LogHandler::debug(Tags::Settings, "save TCodeVersionEnum: %i", doc["TCodeVersion"].as<int>());
    // LogHandler::debug(Tags::Settings, "save ssid: %s", doc["ssid"].as<String>());
    // // LogHandler::debug(Tags::Settings, "save pass: %s", doc["wifiPass"].as<String>());
    // LogHandler::debug(Tags::Settings, "save udpServerPort: %i", doc["udpServerPort"].as<int>());
    // LogHandler::debug(Tags::Settings, "save webServerPort: %i", doc["webServerPort"].as<int>());
    // LogHandler::debug(Tags::Settings, "save hostname: %s", doc["hostname"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save friendlyName: %s", doc["friendlyName"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save pitchFrequencyIsDifferent ", doc["pitchFrequencyIsDifferent"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save msPerRad: %i", doc["msPerRad"].as<int>());
    // LogHandler::debug(Tags::Settings, "save servoFrequency: %i", doc["servoFrequency"].as<int>());
    // LogHandler::debug(Tags::Settings, "save  pitchFrequency: %i", doc["pitchFrequency"].as<int>());
    // LogHandler::debug(Tags::Settings, "save valveFrequency: %i", doc["valveFrequency"].as<int>());
    // LogHandler::debug(Tags::Settings, "save twistFrequency: %i", doc["twistFrequency"].as<int>());
    // LogHandler::debug(Tags::Settings, "save continuousTwist: %i", doc["continuousTwist"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save feedbackTwist: %i", doc["feedbackTwist"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save analogTwist: %i", doc["analogTwist"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save TwistFeedBack_PIN: %i", doc["TwistFeedBack_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save RightServo_PIN: %i", doc["RightServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save LeftServo_PIN: %i", doc["LeftServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save RightUpperServo_PIN: %i", doc["RightUpperServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save LeftUpperServo_PIN: %i", doc["LeftUpperServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save PitchLeftServo_PIN: %i", doc["PitchLeftServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save PitchRightServo_PIN: %i", doc["PitchRightServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save ValveServo_PIN: %i", doc["ValveServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save TwistServo_PIN: %i", doc["TwistServo_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Vibe0_PIN: %i", doc["Vibe0_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Vibe1_PIN: %i", doc["Vibe1_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Lube_Pin: %i", doc["Lube_Pin"].as<int>());
    // LogHandler::debug(Tags::Settings, "save LubeButton_PIN: %i", doc["LubeButton_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save staticIP: %i", doc["staticIP"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save localIP: %s", doc["localIP"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save gateway: %s", doc["gateway"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save subnet: %s", doc["subnet"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save dns1: %s", doc["dns1"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save dns2: %s", doc["dns2"].as<const char*>());
    // LogHandler::debug(Tags::Settings, "save sr6Mode: %i", doc["sr6Mode"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save RightServo_ZERO: %i", doc["RightServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save LeftServo_ZERO: %i", doc["LeftServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save RightUpperServo_ZERO: %i", doc["RightUpperServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save LeftUpperServo_ZERO: %i", doc["LeftUpperServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save PitchLeftServo_ZERO: %i", doc["PitchLeftServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save PitchRightServo_ZERO: %i", doc["PitchRightServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save TwistServo_ZERO: %i", doc["TwistServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save ValveServo_ZERO: %i", doc["ValveServo_ZERO"].as<int>());
    // LogHandler::debug(Tags::Settings, "save autoValve: %i", doc["autoValve"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save inverseValve: %i", doc["inverseValve"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save valveServo90Degrees: %i", doc["valveServo90Degrees"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save inverseStroke: %i", doc["inverseStroke"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save inversePitch: %i", doc["inversePitch"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save lubeEnabled: %i", doc["lubeEnabled"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save lubeAmount: %i", doc["lubeAmount"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Temp_PIN: %i", doc["Temp_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Heater_PIN: %i", doc["Heater_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save displayEnabled: %i", doc["displayEnabled"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save sleeveTempDisplayed: %i", doc["sleeveTempDisplayed"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save internalTempDisplayed: %i", doc["internalTempDisplayed"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save tempSleeveEnabled: %i", doc["tempSleeveEnabled"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save tempInternalEnabled: %i", doc["tempInternalEnabled"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save Display_Screen_Width: %i", doc["Display_Screen_Width"].as<int>());
    // LogHandler::debug(Tags::Settings, "save internalMaxTemp: %f", doc["internalMaxTemp"].as<double>());
    // LogHandler::debug(Tags::Settings, "save internalTempForFan: %f", doc["internalTempForFan"].as<double>());
    // LogHandler::debug(Tags::Settings, "save Display_Screen_Height: %i", doc["Display_Screen_Height"].as<int>());
    // LogHandler::debug(Tags::Settings, "save TargetTemp: %f", doc["TargetTemp"].as<double>());
    // LogHandler::debug(Tags::Settings, "save HeatPWM: %i", doc["HeatPWM"].as<int>());
    // LogHandler::debug(Tags::Settings, "save HoldPWM: %i", doc["HoldPWM"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Display_I2C_Address: %i", doc["Display_I2C_Address"].as<int>());
    // LogHandler::debug(Tags::Settings, "save Display_Rst_PIN: %i", doc["Display_Rst_PIN"].as<int>());
    // LogHandler::debug(Tags::Settings, "save heaterFailsafeTime: %ld", doc["heaterFailsafeTime"].as<long>());
    // LogHandler::debug(Tags::Settings, "save heaterThreshold: %i", doc["heaterThreshold"].as<int>());
    // LogHandler::debug(Tags::Settings, "save heaterResolution: %i", doc["heaterResolution"].as<int>());
    // LogHandler::debug(Tags::Settings, "save heaterFrequency: %i", doc["heaterFrequency"].as<int>());
    // LogHandler::debug(Tags::Settings, "save newtoungeHatExists: %i", doc["newtoungeHatExists"].as<bool>());
    // LogHandler::debug(Tags::Settings, "save logLevel: %i", doc["logLevel"].as<int>());
    // LogHandler::debug(Tags::Settings, "save bluetoothEnabled: %i", doc["bluetoothEnabled"].as<bool>());
    // }

    // static void LogUpdateDebug()
    // {
    //     LogHandler::debug(Tags::Settings, "update TCodeVersionEnum: %i", TCodeVersionEnum);
    //     LogHandler::debug(Tags::Settings, "update ssid: %s", ssid);
    //     //LogHandler::debug(Tags::Settings, "update wifiPass: %s", wifiPass);
    //     LogHandler::debug(Tags::Settings, "update udpServerPort: %i", udpServerPort);
    //     LogHandler::debug(Tags::Settings, "update webServerPort: %i", webServerPort);
    //     LogHandler::debug(Tags::Settings, "update hostname: %s", hostname);
    //     LogHandler::debug(Tags::Settings, "update friendlyName: %s", friendlyName);
    //     LogHandler::debug(Tags::Settings, "update pitchFrequencyIsDifferent: %i", pitchFrequencyIsDifferent);
    //     LogHandler::debug(Tags::Settings, "update msPerRad: %i", msPerRad);
    //     LogHandler::debug(Tags::Settings, "update servoFrequency: %i", servoFrequency);
    //     LogHandler::debug(Tags::Settings, "update pitchFrequency: %i", pitchFrequency);
    //     LogHandler::debug(Tags::Settings, "update valveFrequency: %i", valveFrequency);
    //     LogHandler::debug(Tags::Settings, "update twistFrequency: %i", twistFrequency);
    //     LogHandler::debug(Tags::Settings, "update continuousTwist: %i", continuousTwist);
    //     LogHandler::debug(Tags::Settings, "update feedbackTwist: %i", feedbackTwist);max
    //     LogHandler::debug(Tags::Settings, "update PitchRightServo_ZERO: %i", PitchRightServo_ZERO);
    //     LogHandler::debug(Tags::Settings, "update TwistServo_ZERO: %i", TwistServo_ZERO);
    //     LogHandler::debug(Tags::Settings, "update ValveServo_ZERO: %i", ValveServo_ZERO);
    //     LogHandler::debug(Tags::Settings, "update autoValve: %i", autoValve);
    //     LogHandler::debug(Tags::Settings, "update inverseValve: %i", inverseValve);
    //     LogHandler::debug(Tags::Settings, "update valveServo90Degrees: %i", valveServo90Degrees);
    //     LogHandler::debug(Tags::Settings, "update inverseStroke: %i", inverseStroke);
    //     LogHandler::debug(Tags::Settings, "update inversePitch: %i", inversePitch);
    //     LogHandler::debug(Tags::Settings, "update lubeEnabled: %i", lubeEnabled);
    //     LogHandler::debug(Tags::Settings, "update lubeAmount: %i", lubeAmount);
    //     LogHandler::debug(Tags::Settings, "update displayEnabled: %i", displayEnabled);
    //     LogHandler::debug(Tags::Settings, "update sleeveTempDisplayed: %i", sleeveTempDisplayed);
    //     LogHandler::debug(Tags::Settings, "update internalTempDisplayed: %i", internalTempDisplayed);
    //     LogHandler::debug(Tags::Settings, "update tempSleeveEnabled: %i", tempSleeveEnabled);
    //     LogHandler::debug(Tags::Settings, "update tempInternalEnabled: %i", tempInternalEnabled);
    //     LogHandler::debug(Tags::Settings, "update Display_Screen_Width: %i", Display_Screen_Width);
    //     LogHandler::debug(Tags::Settings, "update Display_Screen_Height: %i", Display_Screen_Height);
    //     LogHandler::debug(Tags::Settings, "update TargetTemp: %i", TargetTemp);
    //     LogHandler::debug(Tags::Settings, "update HeatPWM: %i", HeatPWM);
    //     LogHandler::debug(Tags::Settings, "update HoldPWM: %i", HoldPWM);
    //     LogHandler::debug(Tags::Settings, "update Display_I2C_Address: %i", Display_I2C_Address);
    //     LogHandler::debug(Tags::Settings, "update Display_Rst_PIN: %i", Display_Rst_PIN);
    //     LogHandler::debug(Tags::Settings, "update Sleeve_Temp_PIN: %i", Sleeve_Temp_PIN);
    //     LogHandler::debug(Tags::Settings, "update Heater_PIN: %i", Heater_PIN);
    //     LogHandler::debug(Tags::Settings, "update heaterThreshold: %d", heaterThreshold);
    //     LogHandler::debug(Tags::Settings, "update heaterResolution: %i", heaterResolution);
    //     LogHandler::debug(Tags::Settings, "update heaterFrequency: %i", heaterFrequency);
    //     LogHandler::debug(Tags::Settings, "update logLevel: %i", (int)logLevel);
    //     LogHandler::debug(Tags::Settings, "update bluetoothEnabled: %i", (int)bluetoothEnabled);
    // }
};

SettingsFactory *SettingsHandler::m_settingsFactory;
SemaphoreHandle_t SettingsHandler::m_motionMutex = xSemaphoreCreateMutex();
SemaphoreHandle_t SettingsHandler::m_channelsMutex = xSemaphoreCreateMutex();
SemaphoreHandle_t SettingsHandler::m_wifiMutex = xSemaphoreCreateMutex();
SemaphoreHandle_t SettingsHandler::m_buttonsMutex = xSemaphoreCreateMutex();
SemaphoreHandle_t SettingsHandler::m_settingsMutex = xSemaphoreCreateMutex();
bool SettingsHandler::initialized = false;
int SettingsHandler::restartRequired = -1;
bool SettingsHandler::saving = false;
bool SettingsHandler::motionPaused = false;
bool SettingsHandler::fullBuild = false;
bool SettingsHandler::apMode = false;

// BoardType SettingsHandler::boardType = BoardType::DEVKIT;
BuildFeature SettingsHandler::buildFeatures[(int)BuildFeature::MAX_FEATURES];
std::vector<int> SettingsHandler::systemI2CAddresses;
SETTING_STATE_FUNCTION_PTR_T SettingsHandler::message_callback = 0;
ChannelMap SettingsHandler::channelMap;

char SettingsHandler::currentIP[IP_ADDRESS_LEN] = LOCALIP_DEFAULT;
char SettingsHandler::currentGateway[IP_ADDRESS_LEN] = GATEWAY_DEFAULT;
char SettingsHandler::currentSubnet[IP_ADDRESS_LEN] = SUBNET_DEFAULT;
char SettingsHandler::currentDns1[IP_ADDRESS_LEN] = DNS1_DEFAULT;
char SettingsHandler::currentDns2[IP_ADDRESS_LEN] = DNS2_DEFAULT;

// MotorType SettingsHandler::motorType = MotorType::Servo;
// const char SettingsHandler::HandShakeChannel[4] = "D1\n";
// const char SettingsHandler::SettingsChannel[4] = "D2\n";
// const char *SettingsHandler::userSettingsFilePath = "/userSettings.json";
// const char *SettingsHandler::wifiPassFilePath = "/wifiInfo.json";
// const char *SettingsHandler::buttonsFilePath = "/buttons.json";
// const char *SettingsHandler::motionProfilesFilePath = "/motionProfiles.json";
// const char *SettingsHandler::logPath = "/log.json";
// const char *SettingsHandler::defaultWifiPass = "YOUR PASSWORD HERE";
// const char *SettingsHandler::decoyPass = "Too bad haxor!";
// const char SettingsHandler::defaultIP[15] = "192.168.69.1";
// const char SettingsHandler::defaultGateWay[15] = "192.168.69.254";
// const char SettingsHandler::defaultSubnet[15] = "255.255.255.0";
// bool SettingsHandler::bluetoothEnabled = true;
// LogLevel SettingsHandler::logLevel = LogLevel::INFO;
// bool SettingsHandler::isTcp = true;
// char SettingsHandler::ssid[32];
// char SettingsHandler::wifiPass[63];
// char SettingsHandler::hostname[63];
// char SettingsHandler::friendlyName[100];
// int SettingsHandler::udpServerPort;
// int SettingsHandler::webServerPort;
// int SettingsHandler::PitchRightServo_PIN;
// int SettingsHandler::RightUpperServo_PIN;
// int SettingsHandler::RightServo_PIN;
// int SettingsHandler::PitchLeftServo_PIN;
// int SettingsHandler::LeftUpperServo_PIN;
// int SettingsHandler::LeftServo_PIN;
// int SettingsHandler::ValveServo_PIN;
// int SettingsHandler::TwistServo_PIN;
// int SettingsHandler::TwistFeedBack_PIN;
// int SettingsHandler::Vibe0_PIN;
// int SettingsHandler::Vibe1_PIN;
// int SettingsHandler::LubeButton_PIN;
// int SettingsHandler::Sleeve_Temp_PIN;
// int SettingsHandler::Heater_PIN;
// int SettingsHandler::I2C_SDA_PIN_obsolete = 21;
// int SettingsHandler::I2C_SCL_PIN_obsolete = 22;

