jcfain/TCodeESP32/ESP32/src/settings/SettingsHandler.h
// int SettingsHandler::Internal_Temp_PIN;
// int SettingsHandler::Case_Fan_PIN;
// int SettingsHandler::Squeeze_PIN;
// int SettingsHandler::Vibe2_PIN;
// int SettingsHandler::Vibe3_PIN;

// // int SettingsHandler::HeatLED_PIN = 32;
// //  pin 25 cannot be servo. Throws error
// bool SettingsHandler::lubeEnabled = true;

// bool SettingsHandler::pitchFrequencyIsDifferent;
// int SettingsHandler::msPerRad;
// int SettingsHandler::servoFrequency;
// int SettingsHandler::pitchFrequency;
// int SettingsHandler::valveFrequency;
// int SettingsHandler::twistFrequency;
// int SettingsHandler::squeezeFrequency;
// bool SettingsHandler::feedbackTwist = false;
// bool SettingsHandler::continuousTwist;
// bool SettingsHandler::analogTwist;
// bool SettingsHandler::staticIP;
// char SettingsHandler::localIP[15];
// char SettingsHandler::gateway[15];
// char SettingsHandler::subnet[15];
// char SettingsHandler::dns1[15];
// char SettingsHandler::dns2[15];
// bool SettingsHandler::sr6Mode;
// int SettingsHandler::RightServo_ZERO = 1500;
// int SettingsHandler::LeftServo_ZERO = 1500;
// int SettingsHandler::RightUpperServo_ZERO = 1500;
// int SettingsHandler::LeftUpperServo_ZERO = 1500;
// int SettingsHandler::PitchLeftServo_ZERO = 1500;
// int SettingsHandler::PitchRightServo_ZERO = 1500;

// bool SettingsHandler::BLDC_UsePWM = false;
// bool SettingsHandler::BLDC_UseMT6701 = true;
// bool SettingsHandler::BLDC_UseHallSensor = false;
// int SettingsHandler::BLDC_Pulley_Circumference = 60;
// int SettingsHandler::BLDC_Encoder_PIN = 33;// PWM feedback pin (if used) - P pad on AS5048a
// int SettingsHandler::BLDC_Enable_PIN = 14;// Motor enable - EN on SFOCMini
// int SettingsHandler::BLDC_HallEffect_PIN = 12;
// int SettingsHandler::BLDC_PWMchannel1_PIN = 27;
// int SettingsHandler::BLDC_PWMchannel2_PIN = 26;
// int SettingsHandler::BLDC_PWMchannel3_PIN = 25;
// float SettingsHandler::BLDC_MotorA_Voltage = 20.0; // BLDC Motor operating voltage (12-20V)
// float SettingsHandler::BLDC_MotorA_Current = 1.0;  // BLDC Maximum operating current (Amps)
// int SettingsHandler::BLDC_ChipSelect_PIN = 5;         // SPI chip select pin - CSn on AS5048a (By default on ESP32: MISO = D19, MOSI = D23, CLK = D18)
// bool SettingsHandler::BLDC_MotorA_ParametersKnown = false;     // Once you know the zero elec angle for the motor enter it below and set this flag to true.
// float SettingsHandler::BLDC_MotorA_ZeroElecAngle = 0.00; // This number is the zero angle (in radians) for the motor relative to the encoder.
// int SettingsHandler::BLDC_RailLength;
// int SettingsHandler::BLDC_StrokeLength;

// int SettingsHandler::TwistServo_ZERO = 1500;
// int SettingsHandler::ValveServo_ZERO = 1500;
// int SettingsHandler::SqueezeServo_ZERO = 1500;
// bool SettingsHandler::autoValve = false;
// bool SettingsHandler::inverseValve = false;
// bool SettingsHandler::valveServo90Degrees = false;
// bool SettingsHandler::inverseStroke = false;
// bool SettingsHandler::inversePitch = false;
// int SettingsHandler::lubeAmount = 255;

// bool SettingsHandler::displayEnabled = false;
// bool SettingsHandler::sleeveTempDisplayed = false;
// bool SettingsHandler::internalTempDisplayed = false;
// bool SettingsHandler::versionDisplayed = true;
// bool SettingsHandler::tempSleeveEnabled = false;
// bool SettingsHandler::tempInternalEnabled = false;
// bool SettingsHandler::fanControlEnabled = false;
// bool SettingsHandler::batteryLevelEnabled = true;
// //int SettingsHandler::Battery_Voltage_PIN = 32;
// bool SettingsHandler::batteryLevelNumeric = false;
// double SettingsHandler::batteryVoltageMax = 12.6;
// int SettingsHandler::batteryCapacityMax;
// int SettingsHandler::Display_Screen_Width = 128;
// int SettingsHandler::Display_Screen_Height = 64;
// int SettingsHandler::caseFanMaxDuty = 255;
// double SettingsHandler::internalTempForFan = 20.0;
// double SettingsHandler::internalMaxTemp = 50.0;
// int SettingsHandler::TargetTemp = 40;
// int SettingsHandler::HeatPWM = 255;
// int SettingsHandler::HoldPWM = 110;
// int SettingsHandler::Display_I2C_Address = 0x3C;
// int SettingsHandler::Display_Rst_PIN = -1;
// // long SettingsHandler::heaterFailsafeTime = 60000;
// float SettingsHandler::heaterThreshold = 5.0;
// int SettingsHandler::heaterResolution = 8;
// int SettingsHandler::heaterFrequency = 5000;
// int SettingsHandler::caseFanFrequency = 25;
// int SettingsHandler::caseFanResolution = 10;
// const char *SettingsHandler::lastRebootReason;

// bool SettingsHandler::voiceEnabled = false;
// bool SettingsHandler::voiceMuted = false;
// int SettingsHandler::voiceWakeTime = 10;
// int SettingsHandler::voiceVolume = 10;

// bool SettingsHandler::bootButtonEnabled;
// bool SettingsHandler::buttonSetsEnabled;
// char SettingsHandler::bootButtonCommand[MAX_COMMAND];

bool SettingsHandler::motionEnabled = false;
// char SettingsHandler::motionSelectedProfileName[MAX_MOTION_PROFILE_NAME_LENGTH];
int SettingsHandler::motionSelectedProfileIndex = 0;
int SettingsHandler::motionDefaultProfileIndex = 0;
// uint8_t SettingsHandler::defaultButtonSetPin;
// uint16_t SettingsHandler::buttonAnalogDebounce;
// std::map<const char*, MotionProfile*, StrCompare> SettingsHandler::motionProfiles;
// int SettingsHandler::motionUpdateGlobal;
// int SettingsHandler::motionPeriodGlobal;
// int SettingsHandler::motionAmplitudeGlobal;
// int SettingsHandler::motionOffsetGlobal;
// float SettingsHandler::motionPhaseGlobal;
// bool SettingsHandler::motionReversedGlobal = false;
// bool SettingsHandler::motionPeriodGlobalRandom = false;
// bool SettingsHandler::motionAmplitudeGlobalRandom = false;
// bool SettingsHandler::motionOffsetGlobalRandom = false;
// int SettingsHandler::motionPeriodGlobalRandomMin;
// int SettingsHandler::motionPeriodGlobalRandomMax;
// int SettingsHandler::motionAmplitudeGlobalRandomMin;
// int SettingsHandler::motionAmplitudeGlobalRandomMax;
// int SettingsHandler::motionOffsetGlobalRandomMin;
// int SettingsHandler::motionOffsetGlobalRandomMax;
// int SettingsHandler::motionRandomChangeMin;
// int SettingsHandler:: motionRandomChangeMax;